<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"16cd4af1b596c344789b9d8b432d064c3ead556dc7c33fb48fa1348830e9dfec","plan_job_ref":"Job Pull Request Checks #211 at https://github.com/GSA-TTS/FAC/actions/runs/18159445698","plan_out_hash":"18c8162c683af0398fea7a4128c085284865bfec524a5935600f9ab053ad4d9f","plan_hash":"df5555d01d55f85b5eaba346698507e155d0d6be1f3a13fb6153dbab6592cc55","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 6 to add, 10 to change, 6 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "c35df64a-c0be-4cba-a742-6ef54a3e02aa" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "5bf23df3-e481-475a-b044-3d3ae565e550" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "c35df64a-c0be-4cba-a742-6ef54a3e02aa" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "5bf23df3-e481-475a-b044-3d3ae565e550" -> (known after apply)
!~              source_app      = "c35df64a-c0be-4cba-a742-6ef54a3e02aa" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "5bf23df3-e481-475a-b044-3d3ae565e550" -> (known after apply)
!~              source_app      = "0c2a605b-dda2-449b-8e86-9da4ff3a254f" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "5bf23df3-e481-475a-b044-3d3ae565e550" -> (known after apply)
!~              source_app      = "69025dbf-8d9c-4b1d-ab09-06ba137d1be1" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "5bf23df3-e481-475a-b044-3d3ae565e550" -> (known after apply)
!~              source_app      = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "0c2a605b-dda2-449b-8e86-9da4ff3a254f" -> (known after apply)
!~              source_app      = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.module.cg-logshipper.cloudfoundry_app.logshipper_app will be updated in-place
!~  resource "cloudfoundry_app" "logshipper_app" {
!~      created_at                  = "2025-04-21T19:51:00Z" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "logshipper"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-staging-logshipper.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "f95cf383ea3d0b14111c608a076adfd3a338a57cdbc7b830b16d2f6155529715" -> "e7f45bb27e420cbe794b468bf6f3d7c904785fb624ce575bc8ee97ed0b5a8704"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-09-11T10:47:16Z" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # module.staging.module.cg-logshipper.cloudfoundry_route.logshipper_route will be updated in-place
!~  resource "cloudfoundry_route" "logshipper_route" {
!~      destinations = [
-           {
-               app_id           = "69025dbf-8d9c-4b1d-ab09-06ba137d1be1" -> null
-               app_process_type = "web" -> null
-               id               = "1793196f-4770-4065-9a8d-47af5789cd91" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "ea6986d2-46cd-4850-aff0-0e3c72d24e39"
!~      updated_at   = "2025-04-21T19:51:53Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-09-17T10:45:23Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:2cfce0cacf289fc68dc51d2ed64f1c407136f8acca2923de50eec7cb46339d1a" -> "ghcr.io/gsa-tts/fac/clamav@sha256:cf65d528d34f8b3525fa7653a11b2e9b39cd7454392d8c89e620df857d3adbc3"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging.apps.internal" -> null
            },
        ] -> (known after apply)
+       service_bindings                = (known after apply) # forces replacement
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-09-17T10:45:33Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-09-17T10:45:18Z" -> (known after apply)
        }
    }

  # module.staging.module.fac-file-scanner.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.staging.module.fac-file-scanner.data.external.scannerzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "scannerzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-scanner.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "../shared/modules/scanner"
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_app.scanner_app will be updated in-place
!~  resource "cloudfoundry_app" "scanner_app" {
!~      created_at                  = "2025-04-21T19:51:55Z" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "fac-file-scanner"
!~      path                        = "../shared/modules/scanner/scanner.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-file-scanner-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "4ff1902e1ce701e0e74ac157e5ac0575d97df0fccff30a036e41fdf0929d3e0d" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-09-11T10:48:30Z" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_route.scanner_route must be replaced
-/+ resource "cloudfoundry_route" "scanner_route" {
!~      created_at   = "2025-09-11T10:48:31Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> null
-               app_process_type = "web" -> null
-               id               = "3c2116c5-6195-4787-bea3-703dc4d98b9e" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      updated_at   = "2025-09-11T10:48:31Z" -> (known after apply)
!~      url          = "fac-file-scanner-staging.apps.internal" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-09-17T10:45:23Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:2cfce0cacf289fc68dc51d2ed64f1c407136f8acca2923de50eec7cb46339d1a" -> "ghcr.io/gsa-tts/fac/clamav@sha256:cf65d528d34f8b3525fa7653a11b2e9b39cd7454392d8c89e620df857d3adbc3"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging-fs.apps.internal" -> null
            },
        ] -> (known after apply)
+       service_bindings                = (known after apply) # forces replacement
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-09-17T10:45:33Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.https-proxy.cloudfoundry_app.egress_app must be replaced
-/+ resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-09-11T10:45:54Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "https-proxy"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "gsa-tts-oros-fac-staging-egress-https-proxy.apps.internal" -> null
            },
        ] -> (known after apply)
+       service_bindings            = (known after apply) # forces replacement
!~      source_code_hash            = "799f6e01c7f9c3c69ed59f53762d9d37057ed24cc8f2711f5ea39e4ce0832c07" -> "5aa877ab2a401a3fd57f788f949d21e84e0adc4d24eff3b50fbc4973c87a64e1"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-09-17T10:54:35Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.staging.module.https-proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "5bf23df3-e481-475a-b044-3d3ae565e550" -> null
-               app_process_type = "web" -> null
-               id               = "b3c3389c-401e-4e4e-b0ce-43276d8aca42" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "d2e8c906-3614-474f-869d-3f0e0a12cbbe"
!~      updated_at   = "2025-09-11T10:46:15Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "c35df64a-c0be-4cba-a742-6ef54a3e02aa" -> null
-               app_process_type = "web" -> null
-               id               = "ffa109c7-20e0-45b7-980b-25e48f74c9aa" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "8dec12f0-4f36-4b17-8f5d-f3adfbc29544"
!~      updated_at   = "2025-09-17T10:45:33Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.fac-file-scanner.module.quarantine.data.cloudfoundry_service_plans.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "s3" {
+       name                  = "basic"
+       service_offering_name = "s3"
+       service_plans         = (known after apply)
    }

  # module.staging.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be updated in-place
!~  resource "cloudfoundry_service_instance" "bucket" {
+       dashboard_url     = (known after apply)
        id                = "b4cf43f9-7ada-4c21-9d16-b340672e50ae"
!~      last_operation    = {
!~          created_at  = "2025-03-14T14:54:11Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T14:54:11Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "fac-file-scanner-quarantine"
!~      service_plan      = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806" -> (known after apply)
        tags              = [
            "s3",
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T14:54:11Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.staging.module.file_scanner_clamav.module.route.data.cloudfoundry_domain.domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.module.route.data.cloudfoundry_org.org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.module.route.data.cloudfoundry_space.space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "staging"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route must be replaced
-/+ resource "cloudfoundry_route" "app_route" {
!~      created_at   = "2025-09-11T10:48:41Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "0c2a605b-dda2-449b-8e86-9da4ff3a254f" -> null
-               app_process_type = "web" -> null
-               id               = "0e226849-f800-4738-8999-45e7adca72c7" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      space        = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807" -> (known after apply) # forces replacement
!~      updated_at   = "2025-09-17T10:45:34Z" -> (known after apply)
!~      url          = "fac-av-staging-fs.apps.internal" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 6 to add, 10 to change, 6 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #211](https://github.com/GSA-TTS/FAC/actions/runs/18159445698)